Enums/ТипыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыОплатЧекаККМ</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачетАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРассрочку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОплатЧекаККМ/Ext/ManagerModule.bsl
Функция КодТипаОплатыККМПоТипуОплаты(ТипОплаты) Экспорт
	
	Если ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Наличные Тогда
		
		Возврат 0;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда
		
		Возврат 1;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
		
		Возврат 2;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат Тогда
		
		Возврат 3;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Бонусы Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
